misc/test.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header>
        <RequestSOAPHeader xmlns="http://www.huawei.com.cn/schema/common/v2_1">
            <spId>881188</spId>
            <spPassword>OUI3NEUyMTk2RUYzRDE5RjQyRkZCMTBEQUMwRDczN0JBMDY0RDEwMjNCRDZDQkYzNTNGNTY5RDM5NjcwRjIyOQ==
            </spPassword>
            <serviceId>881188000</serviceId>
            <timeStamp>20170307102900</timeStamp>
        </RequestSOAPHeader>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <ns5:RequestMsg xmlns:ns2="http://www.huawei.com.cn/schema/common/v2_1"
                        xmlns:ns3="http://api-v1.gen.mm.vodafone.com/mminterface/result"
                        xmlns:ns4="http://api-v1.gen.mm.vodafone.com/mminterface/response"
                        xmlns:ns5="http://api-v1.gen.mm.vodafone.com/mminterface/request">
            <ns5:Transaction>
                <ns5:CommandId>RegisterURL</ns5:CommandId>
                <ns5:OriginatorConversationID>6775ce90-364b-4a32-8da3-46b9229e3991-20170307102900061
                </ns5:OriginatorConversationID>
                <ns5:Parameters>
                    <ns5:Parameter>
                        <ns5:Key>ResponseType</ns5:Key>
                        <ns5:Value>Completed</ns5:Value>
                    </ns5:Parameter>
                </ns5:Parameters>
                <ns5:ReferenceData>
                    <ns5:ReferenceItem>
                        <ns5:Key>ValidationURl</ns5:Key>
                        <ns5:Value>http://10.64.0.236:7020/ws/mpesa/validate
                        </ns5:Value>
                    </ns5:ReferenceItem>
                    <ns5:ReferenceItem>
                        <ns5:Key>ConfirmationURL</ns5:Key>
                        <ns5:Value>http://10.64.0.236:7020/ws/mpesa/confirm</ns5:Value>
                    </ns5:ReferenceItem>
                </ns5:ReferenceData>
            </ns5:Transaction>
            <ns5:Identity>
                <ns5:Caller>
                    <ns5:CallerType>0</ns5:CallerType>
                    <ns5:ThirdPartyID/>
                    <ns5:Password/>
                    <ns5:CheckSum/>
                    <ns5:ResultURL/>
                </ns5:Caller>
                <ns5:Initiator>
                    <ns5:IdentifierType>1</ns5:IdentifierType>
                    <ns5:Identifier/>
                    <ns5:SecurityCredential/>
                    <ns5:ShortCode xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xs:string">880072
                    </ns5:ShortCode>
                </ns5:Initiator>
                <ns5:PrimaryParty>
                    <ns5:IdentifierType>1</ns5:IdentifierType>
                    <ns5:Identifier/>
                    <ns5:ShortCode>880072</ns5:ShortCode>
                </ns5:PrimaryParty>
            </ns5:Identity>
            <ns5:KeyOwner>1</ns5:KeyOwner>
        </ns5:RequestMsg>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>